###############################################################
#  Generated by:      Cadence Innovus 18.10-p002_1
#  OS:                Linux x86_64(Host ID ee-mill1)
#  Generated on:      Wed Oct  8 13:45:43 2025
#  Design:            lfsr4
#  Command:           saveDesign ./SAVES/lfsr4_done.enc
###############################################################
current_design lfsr4
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 1.000000 -waveform {0.000000 0.500000}
set_clock_transition  -rise -min 0.05 [get_clocks {clk}]
set_clock_transition  -rise -max 0.05 [get_clocks {clk}]
set_clock_transition  -fall -min 0.05 [get_clocks {clk}]
set_clock_transition  -fall -max 0.05 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_clock_uncertainty 0.02 [get_clocks {clk}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GFILL10BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GOR2D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GAOI21D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GMUX2ND1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GDCAPBWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GOAI21D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GINVD8BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GDCAP2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GNR2D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GINVD1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GXNR2D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GBUFFD3BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GND3D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GFILL3BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GTIEHBWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GAOI22D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GND2D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GDFQD1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GOR2D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GAN2D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GMUX2D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GDCAP4BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GNR3D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GINVD3BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GXOR2D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GDCAP10BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GNR2D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GFILLBWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GXNR2D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/BHDBWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GBUFFD2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GND2D3BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GFILL2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GSDFCNQD1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GAOI21D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GMUX2ND2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GDFCNQD1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GOAI21D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GAN2D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GMUX2D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GDCAP3BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GNR3D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GINVD2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GXOR2D1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GBUFFD8BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GND3D2BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GFILL4BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GTIELBWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GBUFFD1BWP7T}]
set_dont_use  [get_lib_cells {tcbn65lpbwp7twc/GND2D2BWP7T}]
